import numpy as np
"""
Если рассматривать вектор как алгебраический объект, то он может быть предствален в виде строки или столбца чисел,
т.е. в виде матрицы размера (1, n), (n, 1)^2.
В рамках геометрической интерпертации под вектором поднимается направленный отрезок прямой, характеризуемый длиной
и направлением.

Скалярная величина - характеризуется только числовым значением.
Векторная величина - характеризуется числовым значением и направлением.

Вектор обозначается одной маленькой латинской буквой a, либо двумя большими латинскими AB.
a - точка начала вектора.
AB - конец вектора.
|a| - длина вектора (модуль вектора).
"""
